
## Data Mining: Homework 1 - Python Implementation

### Question 1:

Download the excel file ”UntidyData Badly-Structured-Sales-Dat.csv” from Teams and re- arrange this data into the correct four columns. There has been a mix of rows and columns everywhere. Also, watch out for Grand Totals and Sub Totals, you do not need those in tidy data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
file_path ='UntidyData_Badly-Structured-Sales-Dat.csv'
df = pd.read_csv(file_path)

In [3]:
df.head()

,Segment>>,Consumer,Unnamed: 2,Unnamed: 3,Unnamed: 4,Consumer Total,Corporate,Unnamed: 7,Unnamed: 8,Unnamed: 9,Corporate Total,Home Office,Unnamed: 12,Unnamed: 13,Unnamed: 14,Home Office Total
0,Ship Mode>>,First Class,Same Day,Second Class,Standard Class,NaN,First Class,Same Day,Second Class,Standard Class,NaN,First Class,Same Day,Second Class,Standard Class,NaN
1,Order ID,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,CA-2011-100293,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,91.056,91.056
3,CA-2011-100706,NaN,NaN,129.44,NaN,129.44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CA-2011-100895,NaN,NaN,NaN,605.47,605.47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Assignment is to rearrage this dataset in four column.

## 1. Dropping Total columns

In [4]:
# Drop the 'Total' columns
data = df.drop(columns=['Consumer Total', 'Corporate Total', 'Home Office Total'])

data.head()

,Segment>>,Consumer,Unnamed: 2,Unnamed: 3,Unnamed: 4,Corporate,Unnamed: 7,Unnamed: 8,Unnamed: 9,Home Office,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,Ship Mode>>,First Class,Same Day,Second Class,Standard Class,First Class,Same Day,Second Class,Standard Class,First Class,Same Day,Second Class,Standard Class
1,Order ID,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,CA-2011-100293,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,91.056
3,CA-2011-100706,NaN,NaN,129.44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CA-2011-100895,NaN,NaN,NaN,605.47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## 2. Creating New Columns

In [5]:
order_type = sorted(['Consumer', 'Corporate', 'Home Office'] * 4)
order_type.insert(0, 'Order ID')
column_names =[f'{x}|{y}' for x, y in zip(order_type, data.iloc[0].values)]
column_names

['Order ID|Ship Mode>>',
 'Consumer|First Class',
 'Consumer|Same Day',
 'Consumer|Second Class',
 'Consumer|Standard Class',
 'Corporate|First Class',
 'Corporate|Same Day',
 'Corporate|Second Class',
 'Corporate|Standard Class',
 'Home Office|First Class',
 'Home Office|Same Day',
 'Home Office|Second Class',
 'Home Office|Standard Class']

In [6]:
data.columns = column_names

In [7]:
data.head()

,Order ID|Ship Mode>>,Consumer|First Class,Consumer|Same Day,Consumer|Second Class,Consumer|Standard Class,Corporate|First Class,Corporate|Same Day,Corporate|Second Class,Corporate|Standard Class,Home Office|First Class,Home Office|Same Day,Home Office|Second Class,Home Office|Standard Class
0,Ship Mode>>,First Class,Same Day,Second Class,Standard Class,First Class,Same Day,Second Class,Standard Class,First Class,Same Day,Second Class,Standard Class
1,Order ID,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,CA-2011-100293,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,91.056
3,CA-2011-100706,NaN,NaN,129.44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CA-2011-100895,NaN,NaN,NaN,605.47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
# Drop two rows 
rows_to_drop = [0, 1]
data = data.drop(index=rows_to_drop)

In [9]:
data.head()

,Order ID|Ship Mode>>,Consumer|First Class,Consumer|Same Day,Consumer|Second Class,Consumer|Standard Class,Corporate|First Class,Corporate|Same Day,Corporate|Second Class,Corporate|Standard Class,Home Office|First Class,Home Office|Same Day,Home Office|Second Class,Home Office|Standard Class
2,CA-2011-100293,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,91.056
3,CA-2011-100706,NaN,NaN,129.44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CA-2011-100895,NaN,NaN,NaN,605.47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,CA-2011-100916,NaN,NaN,NaN,NaN,NaN,NaN,NaN,788.86,NaN,NaN,NaN,NaN
6,CA-2011-101266,NaN,NaN,13.36,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
data1 = pd.melt(data, id_vars=column_names[0], var_name='OrderType', value_name='Value')
data1.head()

  Order ID|Ship Mode>>             OrderType Value
0       CA-2011-100293  Consumer|First Class   NaN
1       CA-2011-100706  Consumer|First Class   NaN
2       CA-2011-100895  Consumer|First Class   NaN
3       CA-2011-100916  Consumer|First Class   NaN
4       CA-2011-101266  Consumer|First Class   NaN

In [11]:
data1[['OrderType', 'Class']] = data1['OrderType'].str.split('|', expand=True)

data1.head()

  Order ID|Ship Mode>> OrderType Value        Class
0       CA-2011-100293  Consumer   NaN  First Class
1       CA-2011-100706  Consumer   NaN  First Class
2       CA-2011-100895  Consumer   NaN  First Class
3       CA-2011-100916  Consumer   NaN  First Class
4       CA-2011-101266  Consumer   NaN  First Class

In [12]:
data1.shape
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9876 entries, 0 to 9875
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Order ID|Ship Mode>>  9876 non-null   object
 1   OrderType             9876 non-null   object
 2   Value                 834 non-null    object
 3   Class                 9876 non-null   object
dtypes: object(4)
memory usage: 308.8+ KB

### Drop Null Values

In [14]:
data2 = data1.dropna()
data2.head()

   Order ID|Ship Mode>> OrderType   Value        Class
11       CA-2011-103366  Consumer  149.95  First Class
20       CA-2011-109043  Consumer   243.6  First Class
29       CA-2011-113166  Consumer   9.568  First Class
51       CA-2011-124023  Consumer    8.96  First Class
63       CA-2011-130155  Consumer    34.2  First Class

In [15]:
data2.shape
data2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 834 entries, 11 to 9875
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Order ID|Ship Mode>>  834 non-null    object
 1   OrderType             834 non-null    object
 2   Value                 834 non-null    object
 3   Class                 834 non-null    object
dtypes: object(4)
memory usage: 32.6+ KB

## Rename columns

In [28]:
Cleaned_data = data2.rename(columns={'Order ID|Ship Mode>>': 'OrderID', 'OrderType': 'OrderType', 'Value': 'Value','Class':'Class'})

In [29]:
Cleaned_data.head()

           OrderID OrderType   Value        Class
11  CA-2011-103366  Consumer  149.95  First Class
20  CA-2011-109043  Consumer   243.6  First Class
29  CA-2011-113166  Consumer   9.568  First Class
51  CA-2011-124023  Consumer    8.96  First Class
63  CA-2011-130155  Consumer    34.2  First Class

## Rearrange Columns

In [30]:
Cleaned_data= Cleaned_data [['OrderID', 'OrderType', 'Class', 'Value']]

In [31]:
Cleaned_data.head()

           OrderID OrderType        Class   Value
11  CA-2011-103366  Consumer  First Class  149.95
20  CA-2011-109043  Consumer  First Class   243.6
29  CA-2011-113166  Consumer  First Class   9.568
51  CA-2011-124023  Consumer  First Class    8.96
63  CA-2011-130155  Consumer  First Class    34.2